Show / Hide Table of Contents
Class ProgressSender
Inheritance
System.Object
System.ServiceModel.ClientBase<IProgressCallback>
ProgressSender
Implements
System.ServiceModel.ICommunicationObject
System.IDisposable
IProgressCallback
Inherited Members
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.GetDefaultValueForInitialization<T>()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.Open()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.Abort()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.Close()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.DisplayInitializationUI()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.CreateChannel()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.IDisposable.Dispose()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.Open(System.TimeSpan)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.Close(System.TimeSpan)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.BeginClose(System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.BeginClose(System.TimeSpan, System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.EndClose(System.IAsyncResult)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.BeginOpen(System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.BeginOpen(System.TimeSpan, System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.EndOpen(System.IAsyncResult)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.InvokeAsync(System.ServiceModel.ClientBase.BeginOperationDelegate<>, System.Object[], System.ServiceModel.ClientBase.EndOperationDelegate<>, System.Threading.SendOrPostCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.Channel
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.CacheSetting
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.ChannelFactory
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.ClientCredentials
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.State
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.InnerChannel
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.Endpoint
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.Closed
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.Closing
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.Faulted
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.Opened
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IProgressCallback>.System.ServiceModel.ICommunicationObject.Opening
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class ProgressSender : ClientBase<IProgressCallback>, ICommunicationObject, IDisposable, IProgressCallback
Constructors
Improve this Doc   View Source
ProgressSender(String)
Declaration
public ProgressSender(string id)
Parameters
 Type |  Name |  Description
 System.String |  id
Properties
Improve this Doc   View Source
Service
Declaration
protected IProgressCallback Service { get; }
Property Value
 Type |  Description
 IProgressCallback
Methods
Improve this Doc   View Source
ExceptionMessage(String, String)
Declaration
public void ExceptionMessage(string function, string message)
Parameters
 Type |  Name |  Description
 System.String |  function
 System.String |  message
Improve this Doc   View Source
IterationMessage(Double, String, String)
Declaration
public void IterationMessage(double percent, string message, string iteration)
Parameters
 Type |  Name |  Description
 System.Double |  percent
 System.String |  message
 System.String |  iteration
Improve this Doc   View Source
ProgressMessage(Double, String)
Declaration
public void ProgressMessage(double percent, string message)
Parameters
 Type |  Name |  Description
 System.Double |  percent
 System.String |  message
Implements
 System.ServiceModel.ICommunicationObject
 System.IDisposable
 IProgressCallback
 Improve this Doc
 View Source